export const bitikMap: Record<string, string> = {
	а: '𐰀',
	б: '𐰉', // или выбранный из таблицы
	в: '𐰘',
	г: '𐰍',
	д: '𐰓',
	е: '𐰅',
	ё: '𐰅',
	ж: '𐰐',
	з: '𐰔',
	и: '𐰃',
	й: '𐰃',
	к: '𐰚',
	л: '𐰠',
	м: '𐰢',
	н: '𐰤',
	ң: '𐰧',
	о: '𐰆',
	ө: '𐰇',
	п: '𐰯',
	р: '𐰼',
	с: '𐰽',
	т: '𐱅',
	у: '𐰇',
	ү: '𐰇',
	ф: '𐰪',
	х: '𐰴',
	ц: '𐱁',
	ч: '𐰲',
	ш: '𐱂',
	ы: '𐰃',
	э: '𐰃',
	ю: '𐰇𐰆',
	я: '𐰀𐰃',
	// спец. пары
	'рт': '𐰴𐱅',
	'лт': '𐰠𐱅',
	'нт': '𐰤𐱅',
	'нч': '𐰤𐰲',
};


export function transliterateToBitik(input: string): string {
	return input
		.toLowerCase()
		.split('')
		.map((char) => bitikMap[char] || char)
		.reverse() // потому что битик часто читается справа налево
		.join('');
}